CSI API ETABS v1
cLineElm.GetTCLimits Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTCLimits(
	string Name,
	ref bool LimitCompressionExists,
	ref double LimitCompression,
	ref bool LimitTensionExists,
	ref double LimitTension
)
Function GetTCLimits (
	Name As String,
	ByRef LimitCompressionExists As Boolean,
	ByRef LimitCompression As Double,
	ByRef LimitTensionExists As Boolean,
	ByRef LimitTension As Double
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim LimitCompressionExists As Boolean
Dim LimitCompression As Double
Dim LimitTensionExists As Boolean
Dim LimitTension As Double
Dim returnValue As Integer
returnValue = instance.GetTCLimits(Name,
	LimitCompressionExists, LimitCompression,
	LimitTensionExists, LimitTension)
int GetTCLimits(
	String^ Name,
	bool% LimitCompressionExists,
	double% LimitCompression,
	bool% LimitTensionExists,
	double% LimitTension
)
abstract GetTCLimits :
        Name : string *
        LimitCompressionExists : bool byref *
        LimitCompression : float byref *
        LimitTensionExists : bool byref *
        LimitTension : float byref -> int
Parameters
Name
Type: System.String
LimitCompressionExists
Type: System.Boolean
LimitCompression
Type: System.Double
LimitTensionExists
Type: System.Boolean
LimitTension
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace